In [3]:
import pandas as pd
x=["CARS","volsvago","benz","maruthi"]
rate=["RATE","154k","540k","23k"]
a=pd.Series(rate,index=x)
print(a)

CARS        RATE
volsvago    154k
benz        540k
maruthi      23k
dtype: object

In [17]:
date=pd.date_range(start="05-01-2021",end="05-12-2021")
print(date)

DatetimeIndex(['2021-05-01', '2021-05-02', '2021-05-03', '2021-05-04',
               '2021-05-05', '2021-05-06', '2021-05-07', '2021-05-08',
               '2021-05-09', '2021-05-10', '2021-05-11', '2021-05-12'],
              dtype='datetime64[ns]', freq='D')

In [32]:
x={"Type_of_Radiation":["xray","UV","IR","visible"],"Wavelength_Range":["1 nm – 1 pm",'400 nm – 1 nm','2.5 μm – 750 nm','750 nm – 400 nm']}
g=pd.DataFrame(x)
print(g)

  Type_of_Radiation Wavelength_Range
0              xray      1 nm – 1 pm
1                UV    400 nm – 1 nm
2                IR  2.5 μm – 750 nm
3           visible  750 nm – 400 nm

In [63]:
x=[1,2,3,4],[4,6,7,8],[5,5,8,0]
g=pd.DataFrame(x)
print(g)

   0  1  2  3
0  1  2  3  4
1  4  6  7  8
2  5  5  8  0

In [67]:
print(pd.read_csv("India_GDP_Data.csv").to_string())

    Year  GDP_In_Billion_USD  Per_Capita_in_USD  Percentage_Growth
0   2021             3173.40               2277                8.95
1   2020             2667.69               1933               -6.60
2   2019             2831.55               2072                3.74
3   2018             2702.93               1998                6.45
4   2017             2651.47               1981                6.80
5   2016             2294.80               1733                8.26
6   2015             2103.59               1606                8.00
7   2014             2039.13               1574                7.41
8   2013             1856.72               1450                6.39
9   2012             1827.64               1444                5.46
10  2011             1823.05               1458                5.24
11  2010             1675.62               1358                8.50
12  2009             1341.89               1102                7.86
13  2008             1198.90                999                3.09
14  2007             1216.74               1028                7.66
15  2006              940.26                807                8.06
16  2005              820.38                715                7.92
17  2004              709.15                628                7.92
18  2003              607.70                547                7.86
19  2002              514.94                471                3.80
20  2001              485.44                452                4.82
21  2000              468.39                443                3.84
22  1999              458.82                442                8.85
23  1998              421.35                413                6.18
24  1997              415.87                415                4.05
25  1996              392.90                400                7.55
26  1995              360.28                374                7.57
27  1994              327.28                346                6.66
28  1993              279.30                301                4.75
29  1992              288.21                317                5.48
30  1991              270.11                303                1.06
31  1990              320.98                368                5.53
32  1989              296.04                346                5.95
33  1988              296.59                354                9.63
34  1987              279.03                340                3.97
35  1986              248.99                310                4.78
36  1985              232.51                296                5.25
37  1984              212.16                277                3.82
38  1983              218.26                291                7.29
39  1982              200.72                274                3.48
40  1981              193.49                270                6.01
41  1980              186.33                267                6.74
42  1979              152.99                224               -5.24
43  1978              137.30                206                5.71
44  1977              121.49                186                7.25
45  1976              102.72                161                1.66
46  1975               98.47                158                9.15
47  1974               99.53                163                1.19
48  1973               85.52                144                3.30
49  1972               71.46                123               -0.55
50  1971               67.35                119                1.64
51  1970               62.42                112                5.16
52  1969               58.45                108                6.54
53  1968               53.09                100                3.39
54  1967               50.13                 96                7.83
55  1966               45.87                 90               -0.06
56  1965               59.55                119               -2.64
57  1964               56.48                116                7.45
58  1963               48.42                101                5.99
59  1962               42.16                 90                2.93
60  1961               39.23                 85                3.72

In [85]:
df=pd.read_csv("India_GDP_Data.csv")
df=pd.DataFrame(df)
df.sort_values(by=['Year'], ascending=True)
print(df)

    Year  GDP_In_Billion_USD  Per_Capita_in_USD  Percentage_Growth
0   2021             3173.40               2277                8.95
1   2020             2667.69               1933               -6.60
2   2019             2831.55               2072                3.74
3   2018             2702.93               1998                6.45
4   2017             2651.47               1981                6.80
..   ...                 ...                ...                 ...
56  1965               59.55                119               -2.64
57  1964               56.48                116                7.45
58  1963               48.42                101                5.99
59  1962               42.16                 90                2.93
60  1961               39.23                 85                3.72

[61 rows x 4 columns]

In [20]:
df=pd.read_csv("India_GDP_Data.csv")
print(df)
df=pd.DataFrame(df).set_index("Year")
print(df)

    Year  GDP_In_Billion_USD  Per_Capita_in_USD  Percentage_Growth
0   2021             3173.40               2277                8.95
1   2020             2667.69               1933               -6.60
2   2019             2831.55               2072                3.74
3   2018             2702.93               1998                6.45
4   2017             2651.47               1981                6.80
..   ...                 ...                ...                 ...
56  1965               59.55                119               -2.64
57  1964               56.48                116                7.45
58  1963               48.42                101                5.99
59  1962               42.16                 90                2.93
60  1961               39.23                 85                3.72

[61 rows x 4 columns]
      GDP_In_Billion_USD  Per_Capita_in_USD  Percentage_Growth
Year
2021             3173.40               2277                8.95
2020             2667.69               1933               -6.60
2019             2831.55               2072                3.74
2018             2702.93               1998                6.45
2017             2651.47               1981                6.80
...                  ...                ...                 ...
1965               59.55                119               -2.64
1964               56.48                116                7.45
1963               48.42                101                5.99
1962               42.16                 90                2.93
1961               39.23                 85                3.72

[61 rows x 3 columns]

In [26]:
print(df.iloc[[0,1],:])

      GDP_In_Billion_USD  Per_Capita_in_USD  Percentage_Growth
Year
2021             3173.40               2277                8.95
2020             2667.69               1933               -6.60

In [41]:
df=pd.read_csv("dd.csv")
df=pd.DataFrame(df)
print(df)
x=df.groupby("occupation").mean("salary")
print(x)

     name occupation  salary
0    arun       peon    2000
1  adarsh  developer   15000
2  faseen     driver   34000
3  sarath       peon    3000
4    sara     driver    8000
             salary
occupation
developer   15000.0
driver      21000.0
peon         2500.0

In [47]:
df=pd.read_csv("dt.csv")
df=pd.DataFrame(df)
print(df)
df.fillna(0)

     name occupation   salary
0    arun       peon   2000.0
1  adarsh  developer      NaN
2  faseen     driver  34000.0
3  sarath       peon      NaN
4    sara     driver   8000.0

     name occupation   salary
0    arun       peon   2000.0
1  adarsh  developer      0.0
2  faseen     driver  34000.0
3  sarath       peon      0.0
4    sara     driver   8000.0

In [53]:
df=pd.read_csv("df.csv")
df=pd.DataFrame(df)
df
#df["profit"]=df["profit"].apply[lambda x:x>0]
df.loc[df["profit"]>0,"profit"]=True
df.loc[df["profit"]<=0,"profit"]=False
df

  company_name profit
0         tata   True
1     reliance   True
2      infosys  False
3          p&g  False

In [71]:
emp1={
    'empid':[1,2,3,4,5],
    'empname':['ajsar','abhinand','tmt','basil','arun'],
    'stipent':[1000,2000,1500,1400,500],
}
emp2={
    'empid':[1,2,3,4,5],
    'designation':['teacher','doctor','clerk','developer','analyst']
}
df_emp1=pd.DataFrame(emp1)
df_emp2=pd.DataFrame(emp2)
df=pd.merge(df_emp1,df_emp2,how="inner")

In [72]:
df

   empid   empname  stipent designation
0      1     ajsar     1000     teacher
1      2  abhinand     2000      doctor
2      3       tmt     1500       clerk
3      4     basil     1400   developer
4      5      arun      500     analyst